#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

/**********************************************************************
 *                          COMMENT                                   *
 **********************************************************************/
/*
位运算：
	移位运算符：<<, >>
	按位运算符：~, &, |, ^
*/ 
int main(void) {
	/*unsigned u = 0xAB;	
	printf("%u\n", u);
	printf("%x\n", u << 2);
	printf("%u\n", u << 2);
	printf("u = 0x%X\n", u);*/

	//unsigned u = 0xAB;
	//printf("%u\n", u);
	//printf("0x%X\n", u >> 2);
	//printf("%u\n", u >> 2);
	//printf("u = 0x%X\n", u);

	unsigned short i, j, k;

	i = 21;		/* 0000_0000_0001_0101 */
	j = 56;     /* 0000_0000_0011_1000 */
	k = ~i;		/* 1111_1111_1110_1010 */ 
	k = i & j;	/* 0000_0000_0001_0000 */	// 16
	k = i | j;	/* 0000_0000_0011_1101 */	// 64 - 3 = 61
	k = i ^ j;	/* 0000_0000_0010_1101 */   // 61 - 16 = 45

	return 0;
}