#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

/**********************************************************************
 *                          COMMENT                                   *
 **********************************************************************/

int main(void) {
	// 常量数组：元素不能够修改。
	// why: 安全(存储静态数组); 效率(编译器可以对常量数组做一些优化)。

	// const int arr[] = { 1, 2, 3, 4 };
	// arr[0] = 100;

	// printf("arr[0] = %d\n", arr[0]);

	const char suits[4] = { 'S', 'H', 'C', 'D' };
	return 0;
}